BeckZhang2006/FairyNest/fairy_nest/firmware_espidf/sdkconfig.defaults
# FairyNest Smart Bedside Terminal - Project sdkconfig defaults
# ESP-IDF v5.5.2

# Target device: ESP32-S3-DevKitC-1 (N16R8)
CONFIG_IDF_TARGET="esp32s3"

# Enable WiFi CSI (Channel State Information) for presence detection
CONFIG_ESP_WIFI_CSI_ENABLED=y

# Suppress legacy I2S driver deprecation warnings (project still uses old API)
CONFIG_I2S_SUPPRESS_DEPRECATE_WARN=y
